## Plan Result (prod_dynatrace_activegate)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.virtual_machine_admin
  * azurerm_role_assignment.virtual_machine_user
* Update
  * azurerm_linux_virtual_machine_scale_set.main[&#34;dynatrace-activegate&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_virtual_machine_scale_set.main["dynatrace-activegate"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine_scale_set" "main" {
        id                                                = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/dynatrace-activegate-prod/providers/Microsoft.Compute/virtualMachineScaleSets/dynatrace-activegate-prod-vmss"
        name                                              = "dynatrace-activegate-prod-vmss"
        tags                                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/dynatrace-activegate"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (25 unchanged attributes hidden)

      + identity {
          + type = "SystemAssigned"
        }

        # (8 unchanged blocks hidden)
    }

  # azurerm_role_assignment.virtual_machine_admin will be created
  + resource "azurerm_role_assignment" "virtual_machine_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6b8ec7d6-93d8-488d-a4b6-62d499b76d19"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/dynatrace-activegate-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.virtual_machine_user will be created
  + resource "azurerm_role_assignment" "virtual_machine_user" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "26bf2be7-0e5b-442a-9e7b-a1aeddac9803"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/dynatrace-activegate-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":13,"Program":"tfcmt","SHA1":"","Target":"prod_dynatrace_activegate","Vars":{}} -->